Core/src/Documents/КомплектацияВА/КомплектацияВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплектацияВА</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.СостоянияВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКомплектацииВА</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписанияВА</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСписывать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПослеПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияПослеПроведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяцПослеПровледения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМесяцеВЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеВА</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстаточнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМесяцеВЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДекомплектующиеВА</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеВА</name>
      <type>
        <types>EnumRef.СостоянияВнеоборотныхАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМесяцеВЭксплуатации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыОперацийКомплектацииВА/ВидыОперацийКомплектацииВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКомплектацииВА</name>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектация</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/КомплектацияВА/ObjectModule.bsl
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт; //+++ Дмгг

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.КомплектацияВА.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПараметрыВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСостоянияВнеоборотныхАктивов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьВнеоборотныеАктивы(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//Документы.СписаниеВА.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	Если Не Отказ Тогда 
		
		УстановитьПервоначальнуюСтоимостьВСправочнике();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Комплектация Тогда 
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтоимостьПослеПроведения"));
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Разукомплектация Тогда
		
		РазницаСуммТаблицСтоимость = Стоимость - ДекомплектующиеВА.Итог("ПервоначальнаяСтоимость") - СтоимостьПослеПроведения;
		РазницаСуммТаблицАсотризация = Амортизация - ДекомплектующиеВА.Итог("Амортизация") - АмортизацияПослеПроведения;
		РазницаСуммТаблицАмортизацияТекМеся = АмортизацияЗаМесяц - ДекомплектующиеВА.Итог("АмортизацияЗаМесяц") - АмортизацияЗаМесяцПослеПровледения;
		
		Если РазницаСуммТаблицСтоимость <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='ჩამოწერილი ძ/ს ღირებულება არ უდრის მიღებული ძ/ს ღირებულებას!';ru='Стоимость декомплектуемого имущества не равна распределенной!';en='Cost dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если РазницаСуммТаблицАсотризация <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='დაგროვილი ამორტიზაციის თანხა არ უდრის მიღებულ ძ/ს ზე გადანაწილებულ თანხას!';ru='Амортизация декомплектуемого имущества не равна распределенной!';en='Depreciation dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если РазницаСуммТаблицАмортизацияТекМеся <> 0 Тогда
			
			ТекстСообщения = НСтр("ka='მიმდინარე ამორტიზაციის თანხა არ უდრის მიღებულ ძ/ს ზე გადანაწილებულ თანხას!';ru='Амортизация текущего месяца декомплектуемого имущества не равна распределенной!';en='Depreciation of the current month dekomplektuemogo property is not distributed!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
			);
			
		КонецЕсли;
		
		Если Не НеСписывать Тогда 
			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтоимостьПослеПроведения"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	//+++ Дмгг
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДекомплектующиеВА.СчетЗатрат");
	Иначе
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДекомплектующиеВА.СчетЗатратРегл");
	КонецЕсли;
	
	Если Имущество.СпособАмортизации <> Перечисления.СпособыНачисленияАмортизацииВнеоборотныхАктивов.УменьшенногоОстатка Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ГодовойПроцентАмортизацииДляУменьшенногоОстатка");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ЛиквидационнаяСтоимостьДляУменьшенногоОстатка");
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

Процедура РаспределитьСтоимостьИАмортизацию() Экспорт
	
	
	ИсхСуммаСтоимость = 0;
	ИсхСуммаАмортизация = 0;
	ИсхСуммаАмортизацияТекМесяц = 0;
	БазаРаспределения = ДекомплектующиеВА.Итог("ДоляСтоимости");
	БазаРаспределенияСтоимость= БазаРаспределения;//?(НеСписывать, БазаРаспределения + ДоляСтоимости, БазаРаспределения);
	БазаРаспределенияАмортизация = БазаРаспределения;
	БазаРаспределенияАмортизацияТекМесяц = БазаРаспределения;
	ВсегоСтоимость = Стоимость - СтоимостьПослеПроведения;
	ВсегоАмотризация = Амортизация - АмортизацияПослеПроведения;
	ВсегоАмотризацияТекМесяц = АмортизацияЗаМесяц - АмортизацияЗаМесяцПослеПровледения;
	
	Для Каждого СтрокаОС Из ДекомплектующиеВА Цикл
		
		СтрокаОС.ПервоначальнаяСтоимость = ?(БазаРаспределенияСтоимость <> 0, Окр((ВсегоСтоимость - ИсхСуммаСтоимость) * СтрокаОС.ДоляСтоимости / БазаРаспределенияСтоимость, 2, 1),0);
		БазаРаспределенияСтоимость = БазаРаспределенияСтоимость - СтрокаОС.ДоляСтоимости;
		ИсхСуммаСтоимость = ИсхСуммаСтоимость + СтрокаОС.ПервоначальнаяСтоимость;
		
		СтрокаОС.Амортизация = ?(БазаРаспределенияАмортизация <> 0, Окр((ВсегоАмотризация - ИсхСуммаАмортизация) * СтрокаОС.ДоляСтоимости / БазаРаспределенияАмортизация, 2, 1),0);
		БазаРаспределенияАмортизация = БазаРаспределенияАмортизация - СтрокаОС.ДоляСтоимости;
		ИсхСуммаАмортизация = ИсхСуммаАмортизация + СтрокаОС.Амортизация;
		
		СтрокаОС.АмортизацияЗаМесяц = ?(БазаРаспределенияАмортизацияТекМесяц <> 0, Окр((ВсегоАмотризацияТекМесяц - ИсхСуммаАмортизацияТекМесяц) * СтрокаОС.ДоляСтоимости / БазаРаспределенияАмортизацияТекМесяц, 2, 1),0);
		БазаРаспределенияАмортизацияТекМесяц = БазаРаспределенияАмортизацияТекМесяц - СтрокаОС.ДоляСтоимости;
		ИсхСуммаАмортизацияТекМесяц = ИсхСуммаАмортизацияТекМесяц + СтрокаОС.АмортизацияЗаМесяц;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПервоначальнуюСтоимостьВСправочнике()
	
	Если ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Комплектация Тогда 
		
		СправочникОбъект = Имущество.ПолучитьОбъект();
		
		СправочникОбъект.НачальнаяСтоимость = КомплектующиеВА.Итог("Стоимость");
		
		Попытка
			СправочникОбъект.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Не удалось установить начальную стоимость имуществу"+Имущество.Наименование+"'; ka = 'ვერ დახდა ძირითადი საშუალების საწყისი ღირებულების დადგენა"+Имущество.Наименование+"'"));
		КонецПопытки;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКомплектацииВА.Разукомплектация Тогда 
		
		Для Каждого Строк Из ДекомплектующиеВА Цикл 
			
			СправочникОбъект = Строк.ВнеоборотныйАктив.ПолучитьОбъект();
			
			СправочникОбъект.НачальнаяСтоимость = Строк.ПервоначальнаяСтоимость;
			
			Попытка
				СправочникОбъект.Записать();
			Исключение
				Сообщить(НСтр("ru = 'Не удалось установить начальную стоимость имуществу"+Строк.ВнеоборотныйАктив.Наименование+"'; ka = 'ვერ დახდა ძირითადი საშუალების საწყისი ღირებულების დადგენა"+Строк.ВнеоборотныйАктив.Наименование+"'"));
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата()));//+++ Дмгг
